Revit.Elements.AdaptiveComponent.#ctor(System.Double[],Autodesk.Revit.DB.Reference,Revit.Elements.FamilySymbol)
Internal constructor for the AdaptiveComponent wrapper
parms: Params on curve to reference
c: Curve to use as reference
fs: FamilySymbol to place